src/cf/Documents/уатВзаимозачет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатВзаимозачет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>InformationRegister.уатДатыПлатежей</xr:Item>
				<xr:Item>AccumulationRegister.уатРасчетыПоДокументам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дебитор</Name>
					<Comment>Контрагент, который имеет долги перед нами</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредитор</Name>
					<Comment>Контрагент, которому мы должны</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мультивалютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
					<Comment>Договора и сделки по которым выполняется взаимозачет</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорДебитора</Name>
							<Comment>Договор взаиморасчетов дебитора</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКредитора</Name>
							<Comment>Договор взаиморасчетов кредитора</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СделкаДебитора</Name>
							<Comment>Сделка, по которой дебитор должен нам</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СделкаКредитора</Name>
							<Comment>Сделка, по которой мы должны кредитору</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсДебитора</Name>
							<Comment>Курс валюты договора дебитора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьДебитора</Name>
							<Comment>Кратность валюты договора дебитора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсКредитора</Name>
							<Comment>Курс валюты договора кредитора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьКредитора</Name>
							<Comment>Кратность валюты договора кредитора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДебитора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКредитора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДебитора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаКредитора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>По счетам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДокументуАрендаТС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
					<Comment>Используется для обмена с типовыми конфигурациями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионеромНаЗакупку</Name>
					<Comment>Используется для обмена с типовыми конфигурациями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатПолучателиУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатПолучателиУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашаОрганизация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатВзаимозачет/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура("Информация", "Дебитор");
	Возврат Результат;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	уатВзаимозачетСостав.Ссылка.Дата КАК Период,
	|	уатВзаимозачетСостав.Ссылка КАК Регистратор,
	|	уатВзаимозачетСостав.Ссылка.Кредитор КАК Контрагент,
	|	уатВзаимозачетСостав.Ссылка.Организация КАК Организация,
	|	уатВзаимозачетСостав.СделкаКредитора КАК Сделка,
	|	уатВзаимозачетСостав.ДоговорКредитора КАК ДоговорКонтрагента,
	|	уатВзаимозачетСостав.ВалютаКредитора КАК Валюта,
	|	уатВзаимозачетСостав.КурсКредитора КАК Курс,
	|	уатВзаимозачетСостав.КратностьКредитора КАК Кратность,
	|	уатВзаимозачетСостав.СуммаКредитора КАК СуммаВзаиморасчетов,
	|	уатВзаимозачетСостав.СуммаКредитора КАК СуммаУпр
	|ИЗ
	|	Документ.уатВзаимозачет.Состав КАК уатВзаимозачетСостав
	|ГДЕ
	|	уатВзаимозачетСостав.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	уатВзаимозачетСостав.Ссылка.Дата,
	|	уатВзаимозачетСостав.Ссылка,
	|	уатВзаимозачетСостав.Ссылка.Дебитор,
	|	уатВзаимозачетСостав.Ссылка.Организация,
	|	уатВзаимозачетСостав.СделкаДебитора,
	|	уатВзаимозачетСостав.ДоговорДебитора,
	|	уатВзаимозачетСостав.ВалютаДебитора,
	|	уатВзаимозачетСостав.КурсДебитора,
	|	уатВзаимозачетСостав.КратностьДебитора,
	|	уатВзаимозачетСостав.СуммаДебитора,
	|	уатВзаимозачетСостав.СуммаДебитора
	|ИЗ
	|	Документ.уатВзаимозачет.Состав КАК уатВзаимозачетСостав
	|ГДЕ
	|	уатВзаимозачетСостав.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатВзаимозачетСостав.Ссылка.Дата КАК Период,
	|	уатВзаимозачетСостав.Ссылка КАК Регистратор,
	|	уатВзаимозачетСостав.Ссылка.Дебитор КАК Контрагент,
	|	уатВзаимозачетСостав.Ссылка.Организация КАК Организация,
	|	уатВзаимозачетСостав.СделкаДебитора КАК Сделка,
	|	уатВзаимозачетСостав.СделкаДебитора КАК ОбъектОплаты,
	|	ВЫБОР
	|		КОГДА уатВзаимозачетСостав.ДоговорДебитора.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
	|			ТОГДА уатВзаимозачетСостав.СделкаДебитора
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаТС,
	|	ВЫБОР
	|		КОГДА уатВзаимозачетСостав.ДоговорДебитора.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатПолучателиУслуг.НашаОрганизация)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уатПолучателиУслуг.Контрагент)
	|	КОНЕЦ КАК ПолучательУслуг,
	|	уатВзаимозачетСостав.ДоговорДебитора КАК ДоговорКонтрагента,
	|	уатВзаимозачетСостав.ВалютаДебитора КАК Валюта,
	|	уатВзаимозачетСостав.КурсДебитора КАК Курс,
	|	уатВзаимозачетСостав.КратностьДебитора КАК Кратность,
	|	уатВзаимозачетСостав.СуммаДебитора КАК СуммаРасход,
	|	0 КАК СуммаРасходУпр,
	|	0 КАК СуммаПриход,
	|	0 КАК СуммаПриходУпр
	|ИЗ
	|	Документ.уатВзаимозачет.Состав КАК уатВзаимозачетСостав
	|ГДЕ
	|	уатВзаимозачетСостав.Ссылка = &Ссылка
	|	И (уатВзаимозачетСостав.ДоговорДебитора.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
	|			ИЛИ уатВзаимозачетСостав.ДоговорДебитора.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным)
	|			ИЛИ уатВзаимозачетСостав.ДоговорДебитора.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатВзаимозачетСостав.Ссылка.Дата,
	|	уатВзаимозачетСостав.Ссылка,
	|	уатВзаимозачетСостав.Ссылка.Кредитор,
	|	уатВзаимозачетСостав.Ссылка.Организация,
	|	уатВзаимозачетСостав.СделкаКредитора,
	|	уатВзаимозачетСостав.СделкаКредитора,
	|	ВЫБОР
	|		КОГДА уатВзаимозачетСостав.ДоговорКредитора.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
	|			ТОГДА уатВзаимозачетСостав.СделкаКредитора
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА уатВзаимозачетСостав.ДоговорКредитора.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатПолучателиУслуг.НашаОрганизация)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уатПолучателиУслуг.Контрагент)
	|	КОНЕЦ,
	|	уатВзаимозачетСостав.ДоговорКредитора,
	|	уатВзаимозачетСостав.ВалютаКредитора,
	|	уатВзаимозачетСостав.КурсКредитора,
	|	уатВзаимозачетСостав.КратностьКредитора,
	|	0,
	|	0,
	|	уатВзаимозачетСостав.СуммаКредитора,
	|	0
	|ИЗ
	|	Документ.уатВзаимозачет.Состав КАК уатВзаимозачетСостав
	|ГДЕ
	|	уатВзаимозачетСостав.Ссылка = &Ссылка
	|	И (уатВзаимозачетСостав.ДоговорКредитора.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
	|			ИЛИ уатВзаимозачетСостав.ДоговорКредитора.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным)
	|			ИЛИ уатВзаимозачетСостав.ДоговорКредитора.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам))";
	МассивРезультатов = мЗапрос.ВыполнитьПакет();
	
	// взаиморасчеты
	тблВзаиморасчеты = МассивРезультатов[0].Выгрузить();
	Для Каждого ТекСтрока Из тблВзаиморасчеты Цикл
		Если СтруктураДополнительныеСвойства.Свойство("ВалютаУпрУчета") Тогда
			Если ТекСтрока.Валюта <> СтруктураДополнительныеСвойства.ВалютаУпрУчета Тогда
				ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаУпр,
					ТекСтрока.Валюта,    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
					ТекСтрока.Курс,      СтруктураДополнительныеСвойства.КурсУпр,
					ТекСтрока.Кратность, СтруктураДополнительныеСвойства.КратностьУпр,,
					ДокументСсылка);
			КонецЕсли;
		Иначе
			ТекСтрока.СтоимостьУпр = 0;								
		КонецЕсли;
	КонецЦикла;
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетов", тблВзаиморасчеты);
	
	// платежный календарь
	ТаблицаПлатежныйКалендарь = МассивРезультатов[1].Выгрузить();
	Для Каждого ТекСтрока Из ТаблицаПлатежныйКалендарь Цикл		
		ТекСтрока.СуммаПриходУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаПриход,
			ТекСтрока.Валюта,    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			ТекСтрока.Курс,      СтруктураДополнительныеСвойства.КурсУпр,
			ТекСтрока.Кратность, СтруктураДополнительныеСвойства.КратностьУпр,,
			ДокументСсылка);
		ТекСтрока.СуммаРасходУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаРасход,
			ТекСтрока.Валюта,    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			ТекСтрока.Курс,      СтруктураДополнительныеСвойства.КурсУпр,
			ТекСтрока.Кратность, СтруктураДополнительныеСвойства.КратностьУпр,,
			ДокументСсылка);
	КонецЦикла;
	ТаблицаПлатежныйКалендарь.Свернуть(
		"ПолучательУслуг, Период, Регистратор, Организация, Контрагент, ДоговорКонтрагента, Сделка, ЗаказНаТС, Валюта, ОбъектОплаты",
		"СуммаПриход, СуммаПриходУпр, СуммаРасход, СуммаРасходУпр");
	// Разделение на 2 таблицы - расхода и прихода.
	// Расход будет закрывать долг по ФИФО, как платежный документ.
	// Приход будет добавлять долг, как Сделка
	ТаблицаПлатежныйКалендарьКредитор = ТаблицаПлатежныйКалендарь.СкопироватьКолонки();
	ТаблицаПлатежныйКалендарьКредитор.Колонки.Добавить("ЭтапОплаты", Новый ОписаниеТипов("СправочникСсылка.уатЭтапыОплаты"));
	мсвСтрокиКредитор = Новый Массив;
	Для Каждого ТекСтрока Из ТаблицаПлатежныйКалендарь Цикл
		Если ТекСтрока.СуммаПриход > 0 Тогда
			НоваяСтрокаКредитор = ТаблицаПлатежныйКалендарьКредитор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаКредитор, ТекСтрока);
			Если СтрНайти("уатПоступлениеТоваровУслуг, уатРеализацияУслуг, уатСчетНаОплатуПокупателю, уатСчетНаОплатуПоставщика",
				ТекСтрока.Сделка.Метаданные().Имя) <> 0 Тогда
				НоваяСтрокаКредитор.ЭтапОплаты = ТекСтрока.Сделка.ЭтапОплаты;
			КонецЕсли;
			мсвСтрокиКредитор.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекСтрока Из мсвСтрокиКредитор Цикл
		ТаблицаПлатежныйКалендарь.Удалить(ТекСтрока);
	КонецЦикла;
	// распределение отдельно, сначала по Расходу, затем по Приходу
	уатПроведение_проф.РаспределитьПлатежныйКалендарьПоГрафикуОплаты(ТаблицаПлатежныйКалендарь, ДокументСсылка);
	уатПроведение_проф.РаспределитьПлатежныйКалендарьПоГрафикуОплаты(ТаблицаПлатежныйКалендарьКредитор, ДокументСсылка, Новый Структура("Приход", Истина));
	// Обратное объединение в одну таблицу движений
	Для Каждого ТекСтрокаКредитор Из ТаблицаПлатежныйКалендарьКредитор Цикл
		НоваяСтрока = ТаблицаПлатежныйКалендарь.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаКредитор);
	КонецЦикла;
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлатежныйКалендарь", ТаблицаПлатежныйКалендарь);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	Заглушка = Истина;	
КонецПроцедуры // ВыполнитьКонтроль()

#КонецОбласти

#КонецЕсли
